test/tests/fixed-point/restart_heated_plate/fluid-openfoam/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 103500;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 103500;
    }
    outlet
    {
        type            calculated;
        value           uniform 103500;
    }
    top
    {
        type            calculated;
        value           uniform 103500;
    }
    slip-bottom
    {
        type            calculated;
        value           uniform 103500;
    }
    bottom
    {
        type            calculated;
        value           uniform 103500;
    }
    interface
    {
        type            calculated;
        value           uniform 103500;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
