test/tests/fixed-point/restart_heated_plate/fluid-openfoam/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
23692
(
9.30796e-05
0
9.30796e-05
0
9.30796e-05
0
9.30796e-05
0
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
41
(
-9.30796e-05
-9.95994e-05
-0.000106576
-0.000114041
-0.000122029
-0.000130577
-0.000139723
-0.00014951
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
41
(
9.30796e-05
9.95994e-05
0.000106576
0.000114041
0.000122029
0.000130577
0.000139723
0.00014951
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    slip-bottom
    {
        type            calculated;
        value           uniform 0;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    interface
    {
        type            calculated;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
        value           nonuniform List<scalar> 0();
    }
}


// ************************************************************************* //
